public/resume.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-07-20 Wed 12:11 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aziz Ben Ali</title>
<meta name="author" content="Aziz Ben Ali" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/stylesheets/main.css">
<link rel="icon" type="image/x-icon" href="/images/favicon.ico">
</head>
<body>
<div id="preamble" class="status">
<ul class="navigation">
  <li> <a href="/index.html">Home</a> </li>
  <li> <a href="/contact.html">Contact</a> </li>
  <li> <a href="/resume.html">Résumé</a> </li>
</ul>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Aziz Ben Ali</h1>
</header><blockquote>
<p>
You can view my résumé in <a href="data/resume.pdf">PDF format</a>.
</p>
</blockquote>

<div id="outline-container-org7c5dd5a" class="outline-2">
<h2 id="org7c5dd5a">Education</h2>
<div class="outline-text-2" id="text-org7c5dd5a">
</div>
<div id="outline-container-org273ce51" class="outline-3">
<h3 id="org273ce51">École Supérieur Privée d'Ingénierie et de Technologies</h3>
<div class="outline-text-3" id="text-org273ce51">
<div class="properties"><ul><li class="STUDY"> Computer Science</li>
<li class="START_DATE"> Sep. 2019</li>
<li class="END_DATE"> Present</li>
</ul></div>
</div>
</div>
</div>

<div id="outline-container-org6f1e511" class="outline-2">
<h2 id="org6f1e511">Employers</h2>
<div class="outline-text-2" id="text-org6f1e511">
</div>
<div id="outline-container-orga51b25c" class="outline-3">
<h3 id="orga51b25c">Arab Tunisian Bank</h3>
<div class="outline-text-3" id="text-orga51b25c">
<div class="properties"><ul><li class="POSITION"> Software Developer</li>
<li class="TYPE"> Internship</li>
<li class="LOCATION"> Ariana, Tunisia</li>
<li class="START_DATE"> Jul. 11, 2022</li>
<li class="END_DATE"> Present</li>
</ul></div>
</div>
</div>

<div id="outline-container-org31cd783" class="outline-3">
<h3 id="org31cd783">HLi Group</h3>
<div class="outline-text-3" id="text-org31cd783">
<div class="properties"><ul><li class="POSITION"> Web Developer</li>
<li class="TYPE"> Internship</li>
<li class="LOCATION"> Ariana, Tunisia</li>
<li class="START_DATE"> Jul. 2021</li>
<li class="END_DATE"> Sep. 2021</li>
</ul></div>

<ul class="org-ul">
<li>Improved and reworked internal .NET web applications, front- and back-end.</li>
</ul>
</div>
</div>

<div id="outline-container-org618f415" class="outline-3">
<h3 id="org618f415">Thermecatex</h3>
<div class="outline-text-3" id="text-org618f415">
<div class="properties"><ul><li class="POSITION"> Information Technology</li>
<li class="TYPE"> Internship</li>
<li class="LOCATION"> Tunis, Tunisia</li>
<li class="START_DATE"> Aug. 2018</li>
<li class="END_DATE"> Sep. 2018</li>
</ul></div>

<ul class="org-ul">
<li>Helped develop and migrate to a new inventory system, a digitalized version of its predecessor.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org512b6e9" class="outline-2">
<h2 id="org512b6e9">Open Source Projects</h2>
<div class="outline-text-2" id="text-org512b6e9">
<p>
In my spare time, I like to give back to the open source community. I’ve also authored my own tools over the years.
</p>
</div>

<div id="outline-container-org95e5624" class="outline-3">
<h3 id="org95e5624">macchina</h3>
<div class="outline-text-3" id="text-org95e5624">
<p>
A system information frontend, with an (unhealthy) emphasis on performance. <a href="https://github.com/Macchina-CLI/macchina">~GitHub</a>
</p>
</div>
</div>

<div id="outline-container-org0206762" class="outline-3">
<h3 id="org0206762">libmacchina</h3>
<div class="outline-text-3" id="text-org0206762">
<p>
A library providing access to all sorts of system information. <a href="https://github.com/Macchina-CLI/libmacchina">~GitHub</a>
</p>
</div>
</div>

<div id="outline-container-orgc6ba9ed" class="outline-3">
<h3 id="orgc6ba9ed">citron</h3>
<div class="outline-text-3" id="text-orgc6ba9ed">
<p>
A lightweight program providing system data via on-demand notifications. <a href="https://sr.ht/~grtcdr/citron">~SourceHut</a>
</p>
</div>
</div>

<div id="outline-container-org9c85555" class="outline-3">
<h3 id="org9c85555">paspio</h3>
<div class="outline-text-3" id="text-org9c85555">
<p>
A library and command-line utility for calculating password entropy. <a href="https://sr.ht/~grtcdr/paspio">~SourceHut</a>
</p>
</div>
</div>
</div>


<div id="outline-container-orga1dff1e" class="outline-2">
<h2 id="orga1dff1e">Skills</h2>
<div class="outline-text-2" id="text-orga1dff1e">
</div>
<div id="outline-container-org777ba31" class="outline-3">
<h3 id="org777ba31">Programming Languages</h3>
<div class="outline-text-3" id="text-org777ba31">
<ul class="org-ul">
<li>Proficient in Rust and (PL/)SQL.</li>
<li>Comfortable with PHP and shell scripting.</li>
<li>Acquainted with Python, Ruby and Java.</li>
</ul>
</div>
</div>

<div id="outline-container-org960ad69" class="outline-3">
<h3 id="org960ad69">Tools</h3>
<div class="outline-text-3" id="text-org960ad69">
<ul class="org-ul">
<li>Proficient in Linux, i.e. Ubuntu and Arch. I've self-hosted an internet-facing server and exposed various web applications through it.</li>
<li>Comfortable with Git, which I use to version control my personal and public projects.</li>
<li>Comfortable with PlantUML, which I utilize to create plain-text, reproducible and version-controlled UML diagrams.</li>
</ul>
</div>
</div>

<div id="outline-container-org411135e" class="outline-3">
<h3 id="org411135e">Documentation and markup languages</h3>
<div class="outline-text-3" id="text-org411135e">
<ul class="org-ul">
<li>Proficient in Markdown.</li>
<li>Comfortable with Org Mode and HTML.</li>
<li>Acquainted with LaTeX and Asciidoctor.</li>
</ul>
</div>
</div>

<div id="outline-container-orgf8dffb5" class="outline-3">
<h3 id="orgf8dffb5">Languages</h3>
<div class="outline-text-3" id="text-orgf8dffb5">
<ul class="org-ul">
<li>English, fluent</li>
<li>French, conversational</li>
<li>Arabic, native</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
